2025.09.16.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2025.09.09.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2025.09.23.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of September 09 to 16, 2025.

#+TOC: headlines 1


* Dune dev meeting
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-dune-dev-meeting/14994/34

** Shon announced


Hi everyone! :camel:

Starting tomorrow, Wednesday September 9th, 2025, *we will begin holding our Dune dev meeting WEEKLY, every Wednesday*, at alternating time slots.

Whether you are a maintainer, a regular contributor, a new joiner or just curious, you are always welcome to join: these discussions are open! The goal of these meetings is to provide a place to discuss the ongoing work together and synchronize between the Dune developers :smile:

However, we will no longer be manually announcing these meetings, as they are at set recurring times, and the meeting times and ways to participate are well documented.

*** :calendar: Agenda and Notes

If there is a prior agenda, it will be available on the dedicated meeting page [[https://github.com/ocaml/dune/wiki/][available from or dev wiki]]. Feel free to ask if you want to add more items in it.

You may review the meeting notes for any past meetings from the very same pages.

*** :computer: Links

- Meeting link:[[https://us06web.zoom.us/j/85096877776?pwd=cWNhU1dHQ1ZNSjZuOUZCQ0h2by9Udz09][ zoom]]
- Calendar event:[[https://calendar.google.com/calendar/embed?src=c_5cd698df6784e385b1cdcdc1dbca18c061faa96959a04781566d304dc9ec7319%40group.calendar.google.com][ google calendar]]
- Wiki with information and previous notes: [[https://github.com/ocaml/dune/wiki][dune wiki on GitHub]]

:heart:
      



* Dune 3.20
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ann-dune-3-20/17150/13

** Etienne Marais announced


The Dune Team is happy to announce the release of Dune ~3.20.2~.

This release comes with some fixes regarding ~js_of_ocaml~ and ~cram~ test. It also fixes ~dune~ when using Cygwin.

*** Changelog 

**** Fixed

- Fix jsoo separate compilation with modules_without_implementation. Regression
  introduced in ocaml/dune#10767. (ocaml/dune#12320, fixes ocaml/dune#12306 @hhugo)

- Fix ~runtest-js~ mistakenly using wrong dependencies (ocaml/dune#12324, @vouillon)

- Remove empty ~.cram.test.t~ directory during the running of a cram test.
  (ocaml/dune#12329, fixes ocaml/dune#12321, @Alizter)

- Fix Cygwin bootstrap (ocaml/dune#12325, fixes ocaml/dune#12316, @Alizter)
      



* OCaml compiler office hours? (preparation thread)
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/ocaml-compiler-office-hours-preparation-thread/17230/1

** gasche announced


Following our current discussion on making participation to the OCaml compiler development more inviting (https://discuss.ocaml.org/t/why-lean-4-replaced-ocaml-as-my-primary-language/17109/45?u=gasche, https://discuss.ocaml.org/t/synchronous-discussion-channel-for-compiler-contributors/17198/1 ), I propose to give a try to "OCaml compiler office hours". My idea is to do this once during a week day around the end of September (and then we see how it goes).

- Format: a synchronous remote meeting (voice with optional video), backed by a collaborative pad to record questions, take notes, share links etc.
- Topic: anything related to the development of the OCaml compiler, that is, the github/ocaml/ocaml project. (All topics and questions are welcome, at all levels of knowledge and familiarity with the compiler.)
- Duration: probably one to two hours, but the idea of "office hours" is that people can of course join late and leave at any time.

I am including below a poll to ask which time slots would be possible / comfortable for prospective attendants. (As the organizer, I pre-selected slots that are comfortable for me.)
Please only answer the poll if you are motivated to attend such a meeting (the preferences may different from the general timezone of the OCaml community).

/Editor’s note: please follow the archive link above to access the poll./

(If we do this several time we will of course think of a rotation to accomodate people from different timezones.)
      



* Second beta release of OCaml 5.4.0
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/second-beta-release-of-ocaml-5-4-0/17235/1

