2025.09.16.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-16 Tue 13:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2025.09.09.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2025.09.23.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of September 09 to 16, 2025.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">Dune dev meeting</a></li>
<li><a href="#2">Dune 3.20</a></li>
<li><a href="#3">OCaml compiler office hours? (preparation thread)</a></li>
<li><a href="#4">Second beta release of OCaml 5.4.0</a></li>
<li><a href="#5">Unicode 17.0.0 update for Uucd, Uucp, Uunf and Uuseg</a></li>
<li><a href="#6">Scope Image File Viewer</a></li>
<li><a href="#7">OCaml security team</a></li>
<li><a href="#8">Testo 0.2.0 - test library with support for snapshots, parallel runs, xfails, timeouts</a></li>
<li><a href="#9">tinyfiledialogs bindings</a></li>
<li><a href="#10">RFC: <code>for...in</code> construct</a></li>
<li><a href="#11">dead_code_analyzer 1.0.0</a></li>
<li><a href="#12">Relocatable OCaml</a></li>
<li><a href="#13">FUN OCaml is live on YouTube and Twitch</a></li>
<li><a href="#14">Other OCaml News</a></li>
<li><a href="#org6538c14">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">Dune dev meeting</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-dev-meeting/14994/34">https://discuss.ocaml.org/t/ann-dune-dev-meeting/14994/34</a>
</p>
</div>
<div id="outline-container-orgb8cec01" class="outline-3">
<h3 id="orgb8cec01">Shon announced</h3>
<div class="outline-text-3" id="text-orgb8cec01">
<p>
Hi everyone! :camel:
</p>

<p>
Starting tomorrow, Wednesday September 9th, 2025, <b>we will begin holding our Dune dev meeting WEEKLY, every Wednesday</b>, at alternating time slots.
</p>

<p>
Whether you are a maintainer, a regular contributor, a new joiner or just curious, you are always welcome to join: these discussions are open! The goal of these meetings is to provide a place to discuss the ongoing work together and synchronize between the Dune developers :smile:
</p>

<p>
However, we will no longer be manually announcing these meetings, as they are at set recurring times, and the meeting times and ways to participate are well documented.
</p>
</div>
<div id="outline-container-orge5af269" class="outline-4">
<h4 id="orge5af269">:calendar: Agenda and Notes</h4>
<div class="outline-text-4" id="text-orge5af269">
<p>
If there is a prior agenda, it will be available on the dedicated meeting page <a href="https://github.com/ocaml/dune/wiki/">available from or dev wiki</a>. Feel free to ask if you want to add more items in it.
</p>

<p>
You may review the meeting notes for any past meetings from the very same pages.
</p>
</div>
</div>
<div id="outline-container-orgd1f34f4" class="outline-4">
<h4 id="orgd1f34f4">:computer: Links</h4>
<div class="outline-text-4" id="text-orgd1f34f4">
<ul class="org-ul">
<li>Meeting link:<a href="https://us06web.zoom.us/j/85096877776?pwd=cWNhU1dHQ1ZNSjZuOUZCQ0h2by9Udz09"> zoom</a></li>
<li>Calendar event:<a href="https://calendar.google.com/calendar/embed?src=c_5cd698df6784e385b1cdcdc1dbca18c061faa96959a04781566d304dc9ec7319%40group.calendar.google.com"> google calendar</a></li>
<li>Wiki with information and previous notes: <a href="https://github.com/ocaml/dune/wiki">dune wiki on GitHub</a></li>
</ul>

<p>
:heart:
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">Dune 3.20</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-3-20/17150/13">https://discuss.ocaml.org/t/ann-dune-3-20/17150/13</a>
</p>
</div>
<div id="outline-container-org59534f7" class="outline-3">
<h3 id="org59534f7">Etienne Marais announced</h3>
<div class="outline-text-3" id="text-org59534f7">
<p>
The Dune Team is happy to announce the release of Dune <code>3.20.2</code>.
</p>

<p>
This release comes with some fixes regarding <code>js_of_ocaml</code> and <code>cram</code> test. It also fixes <code>dune</code> when using Cygwin.
</p>
</div>
<div id="outline-container-orgcf1477f" class="outline-4">
<h4 id="orgcf1477f">Changelog</h4>
<div class="outline-text-4" id="text-orgcf1477f">
</div>
<ul class="org-ul">
<li><a id="orgcea23c8"></a>Fixed<br />
<div class="outline-text-5" id="text-orgcea23c8">
<ul class="org-ul">
<li>Fix jsoo separate compilation with modules_without_implementation. Regression
introduced in ocaml/dune#10767. (ocaml/dune#12320, fixes ocaml/dune#12306 @hhugo)</li>

<li>Fix <code>runtest-js</code> mistakenly using wrong dependencies (ocaml/dune#12324, @vouillon)</li>

<li>Remove empty <code>.cram.test.t</code> directory during the running of a cram test.
(ocaml/dune#12329, fixes ocaml/dune#12321, @Alizter)</li>

<li>Fix Cygwin bootstrap (ocaml/dune#12325, fixes ocaml/dune#12316, @Alizter)</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">OCaml compiler office hours? (preparation thread)</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-compiler-office-hours-preparation-thread/17230/1">https://discuss.ocaml.org/t/ocaml-compiler-office-hours-preparation-thread/17230/1</a>
</p>
</div>
<div id="outline-container-org8c93aad" class="outline-3">
<h3 id="org8c93aad">gasche announced</h3>
<div class="outline-text-3" id="text-org8c93aad">
<p>
Following our current discussion on making participation to the OCaml compiler development more inviting (<a href="https://discuss.ocaml.org/t/why-lean-4-replaced-ocaml-as-my-primary-language/17109/45?u=gasche">https://discuss.ocaml.org/t/why-lean-4-replaced-ocaml-as-my-primary-language/17109/45?u=gasche</a>, <a href="https://discuss.ocaml.org/t/synchronous-discussion-channel-for-compiler-contributors/17198/1">https://discuss.ocaml.org/t/synchronous-discussion-channel-for-compiler-contributors/17198/1</a> ), I propose to give a try to "OCaml compiler office hours". My idea is to do this once during a week day around the end of September (and then we see how it goes).
</p>

<ul class="org-ul">
<li>Format: a synchronous remote meeting (voice with optional video), backed by a collaborative pad to record questions, take notes, share links etc.</li>
<li>Topic: anything related to the development of the OCaml compiler, that is, the github/ocaml/ocaml project. (All topics and questions are welcome, at all levels of knowledge and familiarity with the compiler.)</li>
<li>Duration: probably one to two hours, but the idea of "office hours" is that people can of course join late and leave at any time.</li>
</ul>

<p>
I am including below a poll to ask which time slots would be possible / comfortable for prospective attendants. (As the organizer, I pre-selected slots that are comfortable for me.)
Please only answer the poll if you are motivated to attend such a meeting (the preferences may different from the general timezone of the OCaml community).
</p>

<p>
<i>Editor’s note: please follow the archive link above to access the poll.</i>
</p>

<p>
(If we do this several time we will of course think of a rotation to accomodate people from different timezones.)
</p>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">Second beta release of OCaml 5.4.0</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/second-beta-release-of-ocaml-5-4-0/17235/1">https://discuss.ocaml.org/t/second-beta-release-of-ocaml-5-4-0/17235/1</a>
</p>
</div>
