2025.09.16.org
** octachron announced


After an extended summer break, the release of OCaml 5.4.0 is getting close.

Since there have been a handful of meaningful bug fixes this summer,
we are releasing a second beta version of OCaml 5.4.0 to help you update
your software and libraries ahead of the release (see below for the
installation instructions). More information about the whole release process is
now available in the [[https://github.com/ocaml/ocaml/blob/trunk/release-info/introduction.md][compiler repository]].

Compared to the first beta release, this beta release contains four notable
bug fixes:
- one type system bugfix for variance annotation on private types
- one memory concurrency safety fix for weak pointers
- two Windows fixes

Those fixes are complemented by:
- one runtime performance fix
- three tools and compiler-libs related fixes
- one error message fix.

The full list of fixes for this second beta is available below.

Overall, this beta release is already quite stable.
If the tests for this beta release go well, we are expecting to have a first release
candidate in the week of the 22 September, and the full release in the beginning
of October.

If you find any bugs, please report them on [[https://github.com/ocaml/ocaml/issues][OCaml's issue tracker]].

The last progresses on stabilising the ecosystem are still tracked on the
[[https://github.com/ocaml/opam-repository/issues/27916][opam readiness for 5.4.0 meta-issue]].


If you are interested in full list of features and bug fixes of the new OCaml
version, the updated change log for OCaml 5.4.0 is available [[https://github.com/ocaml/ocaml/blob/5.4/Changes][on GitHub]].

Happy hacking,
Florian Angeletti for the OCaml team

*** Installation Instructions

The base compiler can be installed as an opam switch with the following commands
on opam 2.1 and later:

#+begin_example
opam update
opam switch create 5.4.0~beta2
#+end_example

The source code for the beta is also available at these addresses:

- [[https://github.com/ocaml/ocaml/archive/5.4.0-beta2.tar.gz][GitHub]]
- [[https://caml.inria.fr/pub/distrib/ocaml-5.4/ocaml-5.4.0~beta2.tar.gz][OCaml archives at Inria]]

**** Fine-Tuned Compiler Configuration

If you want to tweak the configuration of the compiler, you can switch to the option variant with:

#+begin_example
opam update
opam switch create <switch_name> ocaml-variants.5.4.0~beta2+options <option_list>
#+end_example

where ~option_list~ is a space separated list of ~ocaml-option-*~ packages. For instance, for a flambda and no-flat-float-array switch:

#+begin_example
opam switch create 5.4.0~beta2+flambda+nffa ocaml-variants.5.4.0~beta2+options ocaml-option-flambda ocaml-option-no-flat-float-array
#+end_example

All available options can be listed with ~opam search ocaml-option~.

*** Changes since the first beta

**** Type system fix

- [[https://github.com/ocaml/ocaml/issues/14200][#14200]], [[https://github.com/ocaml/ocaml/issues/14202][#14202]] : bad variance check with private aliases
  (Jacques Garrigue, report and review by Stephen Dolan)

**** Windows fixes

- #13504, #13625, +[[https://github.com/ocaml/ocaml/issues/14223][#14223]]: Add ~Thread.set_current_thread_name~.
   (Romain Beauxis, review by Gabriel Scherer and Antonin Décimo)

- [[https://github.com/ocaml/ocaml/issues/13541][#13541]], [[https://github.com/ocaml/ocaml/issues/13777][#13777]]: Using C++11 ~thread_local~ causes name-mangling
  issues when linking with flexlink on Cygwin.
  (Antonin Décimo and David Allsopp, report by Kate Deplaix)

**** Runtime fixes

- [[https://github.com/ocaml/ocaml/issues/14061][#14061]], [[https://github.com/ocaml/ocaml/issues/14209][#14209]]: fix a memory-ordering bug in Weak.set that could
  result in uninitialized memory seen by Weak.get on another domain.
  (Damien Doligez, review by Gabriel Scherer)

- [[https://github.com/ocaml/ocaml/issues/14169][#14169]]: runtime, fix cache miss within the stack fragments cache
  (Florian Angeletti, review by Gabriel Scherer)

**** Tooling fixes

- #13302, +[[https://github.com/ocaml/ocaml/issues/14236][#14236]]: Store locations of longidents components
   (Ulysse Gérard and Jules Aguillon, review by Jules Aguillon
    and Florian Angeletti)

- #12642, #13536, +[[https://github.com/ocaml/ocaml/issues/14184][#14184]], +[[https://github.com/ocaml/ocaml/issues/14192][#14192]]: in the toplevel, print shorter paths for
  constructors and labels when only some modules along their path are open.
   (Gabriel Scherer, review by Florian Angeletti)

- [[https://github.com/ocaml/ocaml/issues/14196][#14196]], [[https://github.com/ocaml/ocaml/issues/14197][#14197]]: ocamlprof: do not instrument unreachable clauses
  (Gabriel Scherer, review by Nicolás Ojeda Bär, report by Ali Caglayan)

**** Error messages

- [[https://github.com/ocaml/ocaml/issues/14214][#14214]], [[https://github.com/ocaml/ocaml/issues/14221][#14221]]: fix a confused error message for module inclusions,
  functor error messages were missing some type equalities potentially leading
  to nonsensical "type t is not compatible with type t" submessage
  (Florian Angeletti, report by Basile Clément, review by Gabriel Scherer)
      



* Unicode 17.0.0 update for Uucd, Uucp, Uunf and Uuseg
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ann-unicode-17-0-0-update-for-uucd-uucp-uunf-and-uuseg/17236/1

