2025.09.16.html
<div id="outline-container-org076ec4b" class="outline-3">
<h3 id="org076ec4b">octachron announced</h3>
<div class="outline-text-3" id="text-org076ec4b">
<p>
After an extended summer break, the release of OCaml 5.4.0 is getting close.
</p>

<p>
Since there have been a handful of meaningful bug fixes this summer,
we are releasing a second beta version of OCaml 5.4.0 to help you update
your software and libraries ahead of the release (see below for the
installation instructions). More information about the whole release process is
now available in the <a href="https://github.com/ocaml/ocaml/blob/trunk/release-info/introduction.md">compiler repository</a>.
</p>

<p>
Compared to the first beta release, this beta release contains four notable
bug fixes:
</p>
<ul class="org-ul">
<li>one type system bugfix for variance annotation on private types</li>
<li>one memory concurrency safety fix for weak pointers</li>
<li>two Windows fixes</li>
</ul>

<p>
Those fixes are complemented by:
</p>
<ul class="org-ul">
<li>one runtime performance fix</li>
<li>three tools and compiler-libs related fixes</li>
<li>one error message fix.</li>
</ul>

<p>
The full list of fixes for this second beta is available below.
</p>

<p>
Overall, this beta release is already quite stable.
If the tests for this beta release go well, we are expecting to have a first release
candidate in the week of the 22 September, and the full release in the beginning
of October.
</p>

<p>
If you find any bugs, please report them on <a href="https://github.com/ocaml/ocaml/issues">OCaml's issue tracker</a>.
</p>

<p>
The last progresses on stabilising the ecosystem are still tracked on the
<a href="https://github.com/ocaml/opam-repository/issues/27916">opam readiness for 5.4.0 meta-issue</a>.
</p>


<p>
If you are interested in full list of features and bug fixes of the new OCaml
version, the updated change log for OCaml 5.4.0 is available <a href="https://github.com/ocaml/ocaml/blob/5.4/Changes">on GitHub</a>.
</p>

<p>
Happy hacking,
Florian Angeletti for the OCaml team
</p>
</div>
<div id="outline-container-org769e26c" class="outline-4">
<h4 id="org769e26c">Installation Instructions</h4>
<div class="outline-text-4" id="text-org769e26c">
<p>
The base compiler can be installed as an opam switch with the following commands
on opam 2.1 and later:
</p>

<pre class="example" id="org5be0149">
opam update
opam switch create 5.4.0~beta2
</pre>

<p>
The source code for the beta is also available at these addresses:
</p>

<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/archive/5.4.0-beta2.tar.gz">GitHub</a></li>
<li><a href="https://caml.inria.fr/pub/distrib/ocaml-5.4/ocaml-5.4.0~beta2.tar.gz">OCaml archives at Inria</a></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orge9482cb"></a>Fine-Tuned Compiler Configuration<br />
<div class="outline-text-5" id="text-orge9482cb">
<p>
If you want to tweak the configuration of the compiler, you can switch to the option variant with:
</p>

<pre class="example" id="org566dea5">
opam update
opam switch create &lt;switch_name&gt; ocaml-variants.5.4.0~beta2+options &lt;option_list&gt;
</pre>

<p>
where <code>option_list</code> is a space separated list of <code>ocaml-option-*</code> packages. For instance, for a flambda and no-flat-float-array switch:
</p>

<pre class="example" id="orga3874fe">
opam switch create 5.4.0~beta2+flambda+nffa ocaml-variants.5.4.0~beta2+options ocaml-option-flambda ocaml-option-no-flat-float-array
</pre>

<p>
All available options can be listed with <code>opam search ocaml-option</code>.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgc41cc85" class="outline-4">
<h4 id="orgc41cc85">Changes since the first beta</h4>
<div class="outline-text-4" id="text-orgc41cc85">
</div>
<ul class="org-ul">
<li><a id="orgc27f48d"></a>Type system fix<br />
<div class="outline-text-5" id="text-orgc27f48d">
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/issues/14200">#14200</a>, <a href="https://github.com/ocaml/ocaml/issues/14202">#14202</a> : bad variance check with private aliases
(Jacques Garrigue, report and review by Stephen Dolan)</li>
</ul>
</div>
</li>
<li><a id="orgfb7ef30"></a>Windows fixes<br />
<div class="outline-text-5" id="text-orgfb7ef30">
<ul class="org-ul">
<li>#13504, #13625, +<a href="https://github.com/ocaml/ocaml/issues/14223">#14223</a>: Add <code>Thread.set_current_thread_name</code>.
(Romain Beauxis, review by Gabriel Scherer and Antonin Décimo)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/13541">#13541</a>, <a href="https://github.com/ocaml/ocaml/issues/13777">#13777</a>: Using C++11 <code>thread_local</code> causes name-mangling
issues when linking with flexlink on Cygwin.
(Antonin Décimo and David Allsopp, report by Kate Deplaix)</li>
</ul>
</div>
</li>
<li><a id="org1f28563"></a>Runtime fixes<br />
<div class="outline-text-5" id="text-org1f28563">
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/issues/14061">#14061</a>, <a href="https://github.com/ocaml/ocaml/issues/14209">#14209</a>: fix a memory-ordering bug in Weak.set that could
result in uninitialized memory seen by Weak.get on another domain.
(Damien Doligez, review by Gabriel Scherer)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/14169">#14169</a>: runtime, fix cache miss within the stack fragments cache
(Florian Angeletti, review by Gabriel Scherer)</li>
</ul>
</div>
</li>
<li><a id="org3010829"></a>Tooling fixes<br />
<div class="outline-text-5" id="text-org3010829">
<ul class="org-ul">
<li>#13302, +<a href="https://github.com/ocaml/ocaml/issues/14236">#14236</a>: Store locations of longidents components
(Ulysse Gérard and Jules Aguillon, review by Jules Aguillon
 and Florian Angeletti)</li>

<li>#12642, #13536, +<a href="https://github.com/ocaml/ocaml/issues/14184">#14184</a>, +<a href="https://github.com/ocaml/ocaml/issues/14192">#14192</a>: in the toplevel, print shorter paths for
constructors and labels when only some modules along their path are open.
 (Gabriel Scherer, review by Florian Angeletti)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/14196">#14196</a>, <a href="https://github.com/ocaml/ocaml/issues/14197">#14197</a>: ocamlprof: do not instrument unreachable clauses
(Gabriel Scherer, review by Nicolás Ojeda Bär, report by Ali Caglayan)</li>
</ul>
</div>
</li>
<li><a id="orge4df5bb"></a>Error messages<br />
<div class="outline-text-5" id="text-orge4df5bb">
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/issues/14214">#14214</a>, <a href="https://github.com/ocaml/ocaml/issues/14221">#14221</a>: fix a confused error message for module inclusions,
functor error messages were missing some type equalities potentially leading
to nonsensical "type t is not compatible with type t" submessage
(Florian Angeletti, report by Basile Clément, review by Gabriel Scherer)</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="5">Unicode 17.0.0 update for Uucd, Uucp, Uunf and Uuseg</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-unicode-17-0-0-update-for-uucd-uucp-uunf-and-uuseg/17236/1">https://discuss.ocaml.org/t/ann-unicode-17-0-0-update-for-uucd-uucp-uunf-and-uuseg/17236/1</a>
</p>
</div>
