2025.09.16.org
** Daniel Bünzli announced


Hello, 

Unicode 17.0.0 was released on September 9th. It adds 4803 new characters for a total of 159'801 characters.

Among other interesting scripts, this adds support for the [[https://en.wikipedia.org/wiki/Zaghawa_alphabet][Beria Erfe script]], a modern-use script from Africa which coincidentally is also refered to as the *camel alphabet*. 

For more information about other additions see [[https://blog.unicode.org/2025/09/unicode-170-release-announcement.html][this page]].

Accordingly these libraries had to be updated (aggregated, boring, release notes [[https://github.com/ocaml/opam-repository/pull/28502][here]])

- [[http://erratique.ch/software/uucd][Uucd]] 17.0.0 Unicode character database decoder for OCaml, [[http://erratique.ch/software/uucd/doc][docs]]
- [[http://erratique.ch/software/uucp][Uucp]] 17.0.0 Unicode character properties for OCaml, [[http://erratique.ch/software/uucp/doc][docs]]
- [[http://erratique.ch/software/uunf][Uunf]] 17.0.0 Unicode text normalization for OCaml, [[http://erratique.ch/software/uunf/doc][docs]]
- [[http://erratique.ch/software/uuseg][Uuseg]] 17.0.0 Unicode text segmentation for OCaml, [[http://erratique.ch/software/uuseg/doc][docs]]

Both ~Uucd~ and ~Uucp~ are incompatible releases sinces new block and script enumerants were added.

Other than that the minimal Unicode introduction and Unicode OCaml tips is still [[https://erratique.ch/software/uucp/doc/unicode.html][here]] and remember that despite the myths OCaml :heart: Unicode.

A big thanks for funding from the [[http://ocaml-sf.org/][OCaml Software Foundation]] and from my [[https://github.com/sponsors/dbuenzli][donors]].

Daniel
      



* Scope Image File Viewer
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/ann-scope-image-file-viewer/17237/1

** Charles Averill announced


I wanted to mess around with image file parsing and ended up building a small image viewer application using SDL. Includes a few hand-written parsers as well as calls to SDL_Image for more complicated formats. Not super performant but working on it.

https://opam.ocaml.org/packages/scope/
      



* OCaml security team
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/ann-ocaml-security-team/16902/5

** Hannes Mehnert announced


Dear everyone,

we’ve accomplished several tasks:

- https://ocaml.org/security is now live
- The public mailing list for security advisories is sympa.inria.fr/sympa/info/ocsf-ocaml-security-announcements – please subscribe if you’d like to receive security announcements
- There’ll be a brief introduction at [[https://fun-ocaml.org][Fun OCaml]] and a talk at [[https://conf.researchr.org/details/icfp-splash-2025/ocaml-2025-papers/9/Toward-a-More-Secure-OCaml-Ecosystem][OCaml workshop (ICFP)]] )16:00 - 16:30
- We will have a public meeting for discussions on Oct 22nd 14:00 - 16:00 CEST (online, yet to be announced where)
- There’s already the OCaml security advisory database https://github.com/ocaml/security-advisories (still empty, we’ll fill it over the next weeks)
      



* Testo 0.2.0 - test library with support for snapshots, parallel runs, xfails, timeouts
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://discuss.ocaml.org/t/ann-testo-0-2-0-test-library-with-support-for-snapshots-parallel-runs-xfails-timeouts/17242/1

** Martin Jambon announced


Testo was designed as a feature-rich testing framework that makes common tasks easy and unusual ones possible. It is similar to Alcotest but supports more options including notably:

- snapshotting: large output capture and diffing
- test-driven development: write tests first, make them pass later (~~expected_outcome~ option)
- review test results without re-running them (~status~ subcommand)
- fast parallel execution supporting Windows and older OCaml versions (>= 4.08)
- complete [[https://semgrep.github.io/testo/][documentation]]: [[https://semgrep.github.io/testo/tutorial/][tutorial]], [[https://semgrep.github.io/testo/howtos/][howto guides]], [[https://semgrep.github.io/testo/reference/testo/Testo/index.html][OCaml API reference]]
- timeouts (new!)

We’ve been using Testo at [[https://github.com/semgrep/semgrep][Semgrep]] where we need the snapshotting feature to track the output of the ~semgrep~ command in end-to-end tests.

[[https://github.com/semgrep/testo/releases/tag/0.2.0][Changes since the last release]] include bugfixes, a few new command-line options, and support for timeouts. Install it now with

#+begin_example
$ opam install testo
#+end_example

Testo development is an open-source community effort that [[https://github.com/semgrep/testo][happens on GitHub]]. It has been funded by Semgrep, my employer and fine purveyor of application security software. We're planning for a 1.0 release once the known Windows-specific bugs are gone. No major breaking changes are in sight.

For reference, the previous announcement from last year is [[https://discuss.ocaml.org/t/ann-testo-0-1-0-a-new-testing-framework-for-ocaml/15624][here]].

Enjoy your free software!
      



* tinyfiledialogs bindings
:PROPERTIES:
:CUSTOM_ID: 9
:END:
Archive: https://discuss.ocaml.org/t/ann-tinyfiledialogs-bindings/17243/1

** Charles Averill announced


Bindings to the cross-platform tinyfiledialogs library, providing an API for (you guessed it) simple graphical file/directory/color selection using what the host operating system provides. 

https://opam.ocaml.org/packages/tinyfiledialogs/
      



* RFC: ~for...in~ construct
:PROPERTIES:
:CUSTOM_ID: 10
:END:
Archive: https://discuss.ocaml.org/t/rfc-for-in-construct/17250/1

** Sacha Ayoun announced


Hello,

Here's [[https://github.com/ocaml/RFCs/pull/56][an RFC]] I drafted for adding a ~for...in~ construct to the language. Feedback is welcome here :slight_smile: 

Some reservations were already voiced [[https://caml.zulipchat.com/#narrow/channel/527805-compiler/topic/.60for.20.2E.2E.20in.60.20in.20OCaml/with/539419833][here]], and acknowledged in the RFC.
      



* dead_code_analyzer 1.0.0
:PROPERTIES:
:CUSTOM_ID: 11
:END:
Archive: https://discuss.ocaml.org/t/ann-dead-code-analyzer-1-0-0/17251/1

