2025.09.16.html
<div id="outline-container-org9dadee7" class="outline-3">
<h3 id="org9dadee7">Daniel Bünzli announced</h3>
<div class="outline-text-3" id="text-org9dadee7">
<p>
Hello, 
</p>

<p>
Unicode 17.0.0 was released on September 9th. It adds 4803 new characters for a total of 159'801 characters.
</p>

<p>
Among other interesting scripts, this adds support for the <a href="https://en.wikipedia.org/wiki/Zaghawa_alphabet">Beria Erfe script</a>, a modern-use script from Africa which coincidentally is also refered to as the <b>camel alphabet</b>. 
</p>

<p>
For more information about other additions see <a href="https://blog.unicode.org/2025/09/unicode-170-release-announcement.html">this page</a>.
</p>

<p>
Accordingly these libraries had to be updated (aggregated, boring, release notes <a href="https://github.com/ocaml/opam-repository/pull/28502">here</a>)
</p>

<ul class="org-ul">
<li><a href="http://erratique.ch/software/uucd">Uucd</a> 17.0.0 Unicode character database decoder for OCaml, <a href="http://erratique.ch/software/uucd/doc">docs</a></li>
<li><a href="http://erratique.ch/software/uucp">Uucp</a> 17.0.0 Unicode character properties for OCaml, <a href="http://erratique.ch/software/uucp/doc">docs</a></li>
<li><a href="http://erratique.ch/software/uunf">Uunf</a> 17.0.0 Unicode text normalization for OCaml, <a href="http://erratique.ch/software/uunf/doc">docs</a></li>
<li><a href="http://erratique.ch/software/uuseg">Uuseg</a> 17.0.0 Unicode text segmentation for OCaml, <a href="http://erratique.ch/software/uuseg/doc">docs</a></li>
</ul>

<p>
Both <code>Uucd</code> and <code>Uucp</code> are incompatible releases sinces new block and script enumerants were added.
</p>

<p>
Other than that the minimal Unicode introduction and Unicode OCaml tips is still <a href="https://erratique.ch/software/uucp/doc/unicode.html">here</a> and remember that despite the myths OCaml :heart: Unicode.
</p>

<p>
A big thanks for funding from the <a href="http://ocaml-sf.org/">OCaml Software Foundation</a> and from my <a href="https://github.com/sponsors/dbuenzli">donors</a>.
</p>

<p>
Daniel
</p>
</div>
</div>
</div>
<div id="outline-container-6" class="outline-2">
<h2 id="6">Scope Image File Viewer</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-scope-image-file-viewer/17237/1">https://discuss.ocaml.org/t/ann-scope-image-file-viewer/17237/1</a>
</p>
</div>
<div id="outline-container-org263e048" class="outline-3">
<h3 id="org263e048">Charles Averill announced</h3>
<div class="outline-text-3" id="text-org263e048">
<p>
I wanted to mess around with image file parsing and ended up building a small image viewer application using SDL. Includes a few hand-written parsers as well as calls to SDL_Image for more complicated formats. Not super performant but working on it.
</p>

<p>
<a href="https://opam.ocaml.org/packages/scope/">https://opam.ocaml.org/packages/scope/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-7" class="outline-2">
<h2 id="7">OCaml security team</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocaml-security-team/16902/5">https://discuss.ocaml.org/t/ann-ocaml-security-team/16902/5</a>
</p>
</div>
<div id="outline-container-org43072d8" class="outline-3">
<h3 id="org43072d8">Hannes Mehnert announced</h3>
<div class="outline-text-3" id="text-org43072d8">
<p>
Dear everyone,
</p>

<p>
we’ve accomplished several tasks:
</p>

<ul class="org-ul">
<li><a href="https://ocaml.org/security">https://ocaml.org/security</a> is now live</li>
<li>The public mailing list for security advisories is sympa.inria.fr/sympa/info/ocsf-ocaml-security-announcements – please subscribe if you’d like to receive security announcements</li>
<li>There’ll be a brief introduction at <a href="https://fun-ocaml.org">Fun OCaml</a> and a talk at <a href="https://conf.researchr.org/details/icfp-splash-2025/ocaml-2025-papers/9/Toward-a-More-Secure-OCaml-Ecosystem">OCaml workshop (ICFP)</a> )16:00 - 16:30</li>
<li>We will have a public meeting for discussions on Oct 22nd 14:00 - 16:00 CEST (online, yet to be announced where)</li>
<li>There’s already the OCaml security advisory database <a href="https://github.com/ocaml/security-advisories">https://github.com/ocaml/security-advisories</a> (still empty, we’ll fill it over the next weeks)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-8" class="outline-2">
<h2 id="8">Testo 0.2.0 - test library with support for snapshots, parallel runs, xfails, timeouts</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-testo-0-2-0-test-library-with-support-for-snapshots-parallel-runs-xfails-timeouts/17242/1">https://discuss.ocaml.org/t/ann-testo-0-2-0-test-library-with-support-for-snapshots-parallel-runs-xfails-timeouts/17242/1</a>
</p>
</div>
<div id="outline-container-org5a830a3" class="outline-3">
<h3 id="org5a830a3">Martin Jambon announced</h3>
<div class="outline-text-3" id="text-org5a830a3">
<p>
Testo was designed as a feature-rich testing framework that makes common tasks easy and unusual ones possible. It is similar to Alcotest but supports more options including notably:
</p>

<ul class="org-ul">
<li>snapshotting: large output capture and diffing</li>
<li>test-driven development: write tests first, make them pass later (<code>~expected_outcome</code> option)</li>
<li>review test results without re-running them (<code>status</code> subcommand)</li>
<li>fast parallel execution supporting Windows and older OCaml versions (&gt;= 4.08)</li>
<li>complete <a href="https://semgrep.github.io/testo/">documentation</a>: <a href="https://semgrep.github.io/testo/tutorial/">tutorial</a>, <a href="https://semgrep.github.io/testo/howtos/">howto guides</a>, <a href="https://semgrep.github.io/testo/reference/testo/Testo/index.html">OCaml API reference</a></li>
<li>timeouts (new!)</li>
</ul>

<p>
We’ve been using Testo at <a href="https://github.com/semgrep/semgrep">Semgrep</a> where we need the snapshotting feature to track the output of the <code>semgrep</code> command in end-to-end tests.
</p>

<p>
<a href="https://github.com/semgrep/testo/releases/tag/0.2.0">Changes since the last release</a> include bugfixes, a few new command-line options, and support for timeouts. Install it now with
</p>

<pre class="example" id="org9ee24a7">
$ opam install testo
</pre>

<p>
Testo development is an open-source community effort that <a href="https://github.com/semgrep/testo">happens on GitHub</a>. It has been funded by Semgrep, my employer and fine purveyor of application security software. We're planning for a 1.0 release once the known Windows-specific bugs are gone. No major breaking changes are in sight.
</p>

<p>
For reference, the previous announcement from last year is <a href="https://discuss.ocaml.org/t/ann-testo-0-1-0-a-new-testing-framework-for-ocaml/15624">here</a>.
</p>

<p>
Enjoy your free software!
</p>
</div>
</div>
</div>
<div id="outline-container-9" class="outline-2">
<h2 id="9">tinyfiledialogs bindings</h2>
<div class="outline-text-2" id="text-9">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-tinyfiledialogs-bindings/17243/1">https://discuss.ocaml.org/t/ann-tinyfiledialogs-bindings/17243/1</a>
</p>
</div>
<div id="outline-container-org8bfd1eb" class="outline-3">
<h3 id="org8bfd1eb">Charles Averill announced</h3>
<div class="outline-text-3" id="text-org8bfd1eb">
<p>
Bindings to the cross-platform tinyfiledialogs library, providing an API for (you guessed it) simple graphical file/directory/color selection using what the host operating system provides. 
</p>

<p>
<a href="https://opam.ocaml.org/packages/tinyfiledialogs/">https://opam.ocaml.org/packages/tinyfiledialogs/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-10" class="outline-2">
<h2 id="10">RFC: <code>for...in</code> construct</h2>
<div class="outline-text-2" id="text-10">
<p>
Archive: <a href="https://discuss.ocaml.org/t/rfc-for-in-construct/17250/1">https://discuss.ocaml.org/t/rfc-for-in-construct/17250/1</a>
</p>
</div>
<div id="outline-container-org00d683d" class="outline-3">
<h3 id="org00d683d">Sacha Ayoun announced</h3>
<div class="outline-text-3" id="text-org00d683d">
<p>
Hello,
</p>

<p>
Here's <a href="https://github.com/ocaml/RFCs/pull/56">an RFC</a> I drafted for adding a <code>for...in</code> construct to the language. Feedback is welcome here :slight_smile: 
</p>

<p>
Some reservations were already voiced <a href="https://caml.zulipchat.com/#narrow/channel/527805-compiler/topic/.60for.20.2E.2E.20in.60.20in.20OCaml/with/539419833">here</a>, and acknowledged in the RFC.
</p>
</div>
</div>
</div>
<div id="outline-container-11" class="outline-2">
<h2 id="11">dead_code_analyzer 1.0.0</h2>
<div class="outline-text-2" id="text-11">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dead-code-analyzer-1-0-0/17251/1">https://discuss.ocaml.org/t/ann-dead-code-analyzer-1-0-0/17251/1</a>
</p>
</div>
