2025.09.16.org
** fantazio announced


Hello everyone,

Almost 10 years later, the [[https://github.com/LexiFi/dead_code_analyzer][dead_code_analyzer]] is coming back !

Thanks to all the more or less recent contributors and reviewers (I am not allowed to tag you all as a new user).

The tool has been updated to *OCaml 5.2*. It is available on ~opam~.
There is planned work to update it to OCaml 5.3.
There is planned work to offer a version compatible with OCaml 4.14. However, there is no intent to maintain the ~dead_code_analyzer~ on any OCaml version other than the latest.

This static analyzer is a complement to the compiler’s warnings on unused code constructs. It reads *.cmi* and *.cmt* files, produced by using ~-keep-locs~ (on by default) on *.mli* files and ~-bin-annot~ on *.ml* files.

It scans a compiled OCaml project and reports various warnings about suspicious code:

- exported values never used,
- class fields never used,
- constructors and record fields never used,
- optional arguments always or never used,
- some stylistic issues.

By default, only the 3 first elements of the above list are reported.
More details available in the project’s /[[https://github.com/LexiFi/dead_code_analyzer/blob/master/README.md][README]]/. A more thorough documentation is in progress.
      



* Relocatable OCaml
:PROPERTIES:
:CUSTOM_ID: 12
:END:
Archive: https://discuss.ocaml.org/t/relocatable-ocaml/17253/1

** David Allsopp announced


It is my great pleasure, 3 years to the day since I finalised the first full demonstration of it in Ljubljana for the OCaml Workshop in 2022, to announce the general availability of Relocatable OCaml for testing and review.

For example, this creates a 5.4.0 switch (the good old-fashioned slow way):
#+begin_example
$ time opam switch create --repos=relocatable=git+https://github.com/dra27/opam-repository.git#relocatable,default original-compiler ocaml.5.4.0
real    1m27.646s
#+end_example
But, having run that, subsequent switches are a just a tad quicker:
#+begin_example
$ eval $(opam env)
$ ocamlopt -where
/home/opam/.opam/original-compiler/lib/ocaml
$ time opam switch create . --repos=relocatable,default ocaml.5.4.0
real    0m5.105s
$ eval $(opam env)
$ ocamlopt -where
/home/opam/myproject/_opam/lib/ocaml
#+end_example
And, um, that's it really!

Oh, there are a few other things bundled into the [[https://github.com/dra27/opam-repository/tree/relocatable/packages][relocatable branch]] on dra27/opam-repository:
- It's available for all versions of OCaml since 4.08. They install using their "trunk" versions - i.e. the version number of what would be the next release of OCaml (4.08.2, 4.09.2, 4.10.3, 4.11.3, 4.12.2, 4.13.2, 4.14.3, 5.0.1, 5.1.2, 5.2.2, 5.1.3, pre-release 5.4.0 and, for completeness, trunk OCaml is present as 5.5.0)
- Relocatable versions of ~ocamlbuild~ and ~ocamlfind~ are included, along with patches for ~omod~ and ~stdcompat~
- The ~ocaml-option-~ packages work for all of the older versions, too
- They all work on Windows (including 4.08-4.12, which aren't yet available in opam-repository)
- They all work on Apple silicon (including 4.08, 4.09 and 4.11)

I have literally just opened the PRs on ocaml/ocaml ([[https://github.com/ocaml/ocaml/pull/14243][ocaml/ocaml#14243]], [[https://github.com/ocaml/ocaml/pull/14244][ocaml/ocaml#14244]], [[https://github.com/ocaml/ocaml/pull/14245][ocaml/ocaml#14245]] and [[https://github.com/ocaml/ocaml/pull/14246][ocaml/ocaml#14246]]). In the interests of those of us who maintain libraries and tools which have to target multiple versions of OCaml, there will be some kind of story for keeping these older versions available, but the focus for now will be reaching a consensus for merging the feature itself into OCaml 5.5.

Please do test and report any issues at https://github.com/dra27/relocatable/issues. Over-zealous lock-file systems notwithstanding, the compiler should be as "drop-in" a replacement as updating to any "point release" of the compiler (i.e. if you have something which works in OCaml 5.3.0 but doesn't work in Relocatable OCaml 5.3.1, that's a bug, and I'd _love_ to hear about it a.s.a.p., please!)
      



* FUN OCaml is live on YouTube and Twitch
:PROPERTIES:
:CUSTOM_ID: 13
:END:
Archive: https://discuss.ocaml.org/t/fun-ocaml-is-live-on-youtube-and-twitch/17254/1

** Sabine Schmaltz announced


We're at FUN OCaml and having some awesome OCaml talks today! And you can join us remotely. 🧡🐫

For the schedule and links to the live streams of FUN OCaml 2025 from Warsaw, see

https://fun-ocaml.com

We also have a discord server for FUN OCaml here:

https://discord.gg/DxAghYKqn4
      



* Other OCaml News
:PROPERTIES:
:CUSTOM_ID: 14
:END:
** From the ocaml.org blog


Here are links from many OCaml blogs aggregated at [[https://ocaml.org/blog/][the ocaml.org blog]].

- [[https://www.dra27.uk/blog/platform/2025/09/15/relocatable-ocaml.html][Relocatable OCaml - from concept to demo to PRs]]
- [[https://ocaml.org/events][Upcoming OCaml Events]]
- [[https://fearful-odds.rocks/blog/db-migration-runner-for-chaufr][Shipping a robust DB migration runner for Chaufr (OCaml + Caqti + Lwt)]]
- [[https://www.youtube.com/watch/L_rTHhIEfVM?version=3][FUN OCaml 2025 - Join us in Warsaw, Poland on September 15 for a day full of presentations!]]
- [[https://tarides.com/blog/2025-09-10-dynamic-formal-verification-in-ocaml-an-ortac-qcheck-stm-tutorial][Dynamic Formal Verification in OCaml: An Ortac/QCheck-STM Tutorial]]
- [[https://jon.recoil.org/blog/2025/09/caching-opam-solutions.html][Caching opam solutions]]
- [[https://jon.recoil.org/blog/2025/09/build-ids-for-day10.html][Build IDs for Day10]]
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe to the [[https://sympa.inria.fr/sympa/info/caml-list][caml-list]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
