2025.09.16.html
<div id="outline-container-org011b3da" class="outline-3">
<h3 id="org011b3da">fantazio announced</h3>
<div class="outline-text-3" id="text-org011b3da">
<p>
Hello everyone,
</p>

<p>
Almost 10 years later, the <a href="https://github.com/LexiFi/dead_code_analyzer">dead_code_analyzer</a> is coming back !
</p>

<p>
Thanks to all the more or less recent contributors and reviewers (I am not allowed to tag you all as a new user).
</p>

<p>
The tool has been updated to <b>OCaml 5.2</b>. It is available on <code>opam</code>.
There is planned work to update it to OCaml 5.3.
There is planned work to offer a version compatible with OCaml 4.14. However, there is no intent to maintain the <code>dead_code_analyzer</code> on any OCaml version other than the latest.
</p>

<p>
This static analyzer is a complement to the compiler’s warnings on unused code constructs. It reads <b>.cmi</b> and <b>.cmt</b> files, produced by using <code>-keep-locs</code> (on by default) on <b>.mli</b> files and <code>-bin-annot</code> on <b>.ml</b> files.
</p>

<p>
It scans a compiled OCaml project and reports various warnings about suspicious code:
</p>

<ul class="org-ul">
<li>exported values never used,</li>
<li>class fields never used,</li>
<li>constructors and record fields never used,</li>
<li>optional arguments always or never used,</li>
<li>some stylistic issues.</li>
</ul>

<p>
By default, only the 3 first elements of the above list are reported.
More details available in the project’s <i><a href="https://github.com/LexiFi/dead_code_analyzer/blob/master/README.md">README</a></i>. A more thorough documentation is in progress.
</p>
</div>
</div>
</div>
<div id="outline-container-12" class="outline-2">
<h2 id="12">Relocatable OCaml</h2>
<div class="outline-text-2" id="text-12">
<p>
Archive: <a href="https://discuss.ocaml.org/t/relocatable-ocaml/17253/1">https://discuss.ocaml.org/t/relocatable-ocaml/17253/1</a>
</p>
</div>
<div id="outline-container-org0991643" class="outline-3">
<h3 id="org0991643">David Allsopp announced</h3>
<div class="outline-text-3" id="text-org0991643">
<p>
It is my great pleasure, 3 years to the day since I finalised the first full demonstration of it in Ljubljana for the OCaml Workshop in 2022, to announce the general availability of Relocatable OCaml for testing and review.
</p>

<p>
For example, this creates a 5.4.0 switch (the good old-fashioned slow way):
</p>
<pre class="example" id="org41320d7">
$ time opam switch create --repos=relocatable=git+https://github.com/dra27/opam-repository.git#relocatable,default original-compiler ocaml.5.4.0
real    1m27.646s
</pre>
<p>
But, having run that, subsequent switches are a just a tad quicker:
</p>
<pre class="example" id="org9991b42">
$ eval $(opam env)
$ ocamlopt -where
/home/opam/.opam/original-compiler/lib/ocaml
$ time opam switch create . --repos=relocatable,default ocaml.5.4.0
real    0m5.105s
$ eval $(opam env)
$ ocamlopt -where
/home/opam/myproject/_opam/lib/ocaml
</pre>
<p>
And, um, that's it really!
</p>

<p>
Oh, there are a few other things bundled into the <a href="https://github.com/dra27/opam-repository/tree/relocatable/packages">relocatable branch</a> on dra27/opam-repository:
</p>
<ul class="org-ul">
<li>It's available for all versions of OCaml since 4.08. They install using their "trunk" versions - i.e. the version number of what would be the next release of OCaml (4.08.2, 4.09.2, 4.10.3, 4.11.3, 4.12.2, 4.13.2, 4.14.3, 5.0.1, 5.1.2, 5.2.2, 5.1.3, pre-release 5.4.0 and, for completeness, trunk OCaml is present as 5.5.0)</li>
<li>Relocatable versions of <code>ocamlbuild</code> and <code>ocamlfind</code> are included, along with patches for <code>omod</code> and <code>stdcompat</code></li>
<li>The <code>ocaml-option-</code> packages work for all of the older versions, too</li>
<li>They all work on Windows (including 4.08-4.12, which aren't yet available in opam-repository)</li>
<li>They all work on Apple silicon (including 4.08, 4.09 and 4.11)</li>
</ul>

<p>
I have literally just opened the PRs on ocaml/ocaml (<a href="https://github.com/ocaml/ocaml/pull/14243">ocaml/ocaml#14243</a>, <a href="https://github.com/ocaml/ocaml/pull/14244">ocaml/ocaml#14244</a>, <a href="https://github.com/ocaml/ocaml/pull/14245">ocaml/ocaml#14245</a> and <a href="https://github.com/ocaml/ocaml/pull/14246">ocaml/ocaml#14246</a>). In the interests of those of us who maintain libraries and tools which have to target multiple versions of OCaml, there will be some kind of story for keeping these older versions available, but the focus for now will be reaching a consensus for merging the feature itself into OCaml 5.5.
</p>

<p>
Please do test and report any issues at <a href="https://github.com/dra27/relocatable/issues">https://github.com/dra27/relocatable/issues</a>. Over-zealous lock-file systems notwithstanding, the compiler should be as "drop-in" a replacement as updating to any "point release" of the compiler (i.e. if you have something which works in OCaml 5.3.0 but doesn't work in Relocatable OCaml 5.3.1, that's a bug, and I'd <span class="underline">love</span> to hear about it a.s.a.p., please!)
</p>
</div>
</div>
</div>
<div id="outline-container-13" class="outline-2">
<h2 id="13">FUN OCaml is live on YouTube and Twitch</h2>
<div class="outline-text-2" id="text-13">
<p>
Archive: <a href="https://discuss.ocaml.org/t/fun-ocaml-is-live-on-youtube-and-twitch/17254/1">https://discuss.ocaml.org/t/fun-ocaml-is-live-on-youtube-and-twitch/17254/1</a>
</p>
</div>
<div id="outline-container-orga64c5d2" class="outline-3">
<h3 id="orga64c5d2">Sabine Schmaltz announced</h3>
<div class="outline-text-3" id="text-orga64c5d2">
<p>
We're at FUN OCaml and having some awesome OCaml talks today! And you can join us remotely. 🧡🐫
</p>

<p>
For the schedule and links to the live streams of FUN OCaml 2025 from Warsaw, see
</p>

<p>
<a href="https://fun-ocaml.com">https://fun-ocaml.com</a>
</p>

<p>
We also have a discord server for FUN OCaml here:
</p>

<p>
<a href="https://discord.gg/DxAghYKqn4">https://discord.gg/DxAghYKqn4</a>
</p>
</div>
</div>
</div>
<div id="outline-container-14" class="outline-2">
<h2 id="14">Other OCaml News</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org9c42361" class="outline-3">
<h3 id="org9c42361">From the ocaml.org blog</h3>
<div class="outline-text-3" id="text-org9c42361">
<p>
Here are links from many OCaml blogs aggregated at <a href="https://ocaml.org/blog/">the ocaml.org blog</a>.
</p>

<ul class="org-ul">
<li><a href="https://www.dra27.uk/blog/platform/2025/09/15/relocatable-ocaml.html">Relocatable OCaml - from concept to demo to PRs</a></li>
<li><a href="https://ocaml.org/events">Upcoming OCaml Events</a></li>
<li><a href="https://fearful-odds.rocks/blog/db-migration-runner-for-chaufr">Shipping a robust DB migration runner for Chaufr (OCaml + Caqti + Lwt)</a></li>
<li><a href="https://www.youtube.com/watch/L_rTHhIEfVM?version=3">FUN OCaml 2025 - Join us in Warsaw, Poland on September 15 for a day full of presentations!</a></li>
<li><a href="https://tarides.com/blog/2025-09-10-dynamic-formal-verification-in-ocaml-an-ortac-qcheck-stm-tutorial">Dynamic Formal Verification in OCaml: An Ortac/QCheck-STM Tutorial</a></li>
<li><a href="https://jon.recoil.org/blog/2025/09/caching-opam-solutions.html">Caching opam solutions</a></li>
<li><a href="https://jon.recoil.org/blog/2025/09/build-ids-for-day10.html">Build IDs for Day10</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6538c14" class="outline-2">
<h2 id="org6538c14">Old CWN</h2>
<div class="outline-text-2" id="text-org6538c14">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="org220e967">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
